/**
 ****************************************************************************************************
 * @file        myTIME.h
 * @author      夏雨祺
 * @version     V2.0
 * @date        2024-09-03
 * @brief       光电传感器响应测试（PWM控制、ADC、按键中断）
 * @license     中国矿业大学安全工程学院
 ****************************************************************************************************
 * @attention
 *
 ****************************************************************************************************
 */

#ifndef _MYTIME_H
#define _MYTIME_H
#include "./SYSTEM/sys/sys.h"

/******************************************************************************************/
/* 时间计数 定时器定义 */

#define myTIME TIM2
#define myTIME_CLK_ENABLE()          \
    do                               \
    {                                \
        __HAL_RCC_TIM2_CLK_ENABLE(); \
    } while (0) /* TIM2 时钟使能 */

/******************************************************************************************/

void myTIME_Init(void);        /* 初始化时间计数 */
uint32_t GetElapsedTime(void); /* 读取经过的时间 */

#endif
